tutorials/viscoelastic/viscoelasticFluidFoam/PP/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/opt/OpenFOAM/jovani-1.4.1/run/tutorials/viscoelasticFluidFoam";
    case "XPP_DE";
    instance "system";
    local "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p CG
    {
        preconditioner
        {
//          type           Cholesky;
            type            AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      0;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           off;
            smoother        ILU;
        }

        tolerance        1e-07;
        relTol           0.0;
        minIter          0;
        maxIter          800;
    };

    U BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Sfirst BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Ssecond BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Sthird BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Sfourth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Sfifth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Ssixth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Sseventh BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdafirst BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdasecond BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdathird BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdafourth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdafifth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdasixth BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

    Lambdaseventh BiCGStab
    {
        preconditioner
        {
            type          Cholesky;
        }

        minIter           0;
        maxIter           1000;
        tolerance         1e-6;
        relTol            0.0;
    };

}

PISO
{
    momentumPredictor yes;
    nCorrectors    2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p                   0.3;

    U                   0.5;

    Sfirst              0.3;
    Ssecond             0.3;
    Sthird              0.3;
    Sfourth             0.3;
    Sfifth              0.3;
    Ssixth              0.3;

    Lambdafirst         0.3;
    Lambdasecond        0.3;
    Lambdathird         0.3;
    Lambdafourth        0.3;
    Lambdafifth         0.3;
    Lambdasixth         0.3;
}



// ************************************************************************* //
